# Selecting Entries with iloc and loc

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
dates = pd.date_range('20130101', periods=6)
df= DataFrame(np.random.randn(6,4),
             index=dates,
             columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -1.280554 -1.400685 -0.875050  0.050216
2013-01-02 -1.215928 -0.521857  0.517917 -0.205408
2013-01-03  2.156521 -0.425014 -1.231518 -0.817544
2013-01-04 -0.102686  0.523724 -0.348742  3.234137
2013-01-05 -1.530831 -0.147866  0.714976  2.037173
2013-01-06 -0.118054 -1.480730  0.116631  0.287130

In [11]:
nfl= pd.read_clipboard()
nfl

,Rank,Team,Won,Lost,Tied,Pct.,First NFL Season,Total Games,Division
0,1,Dallas Cowboys,493,367,6,0.573,1960,866,NFC East
1,2,Green Bay Packers,730,553,37,0.567,1921,"1,320",NFC North
2,3,Chicago Bears,744,568,42,0.565,1920,"1,354",NFC North
3,4,Miami Dolphins,439,341,4,0.563,1966,784,AFC East
4,5,New England Patriots,476,383,9,0.554,1960,868,AFC East

## Selecting Entries .loc and .iloc

In [3]:
df.iloc[0]

A   -1.280554
B   -1.400685
C   -0.875050
D    0.050216
Name: 2013-01-01 00:00:00, dtype: float64

In [4]:
df.loc[dates[0]] # df.loc[0] would not work as the index is not a RangeIndex object

A   -1.280554
B   -1.400685
C   -0.875050
D    0.050216
Name: 2013-01-01 00:00:00, dtype: float64

In [5]:
df.iloc[0:1]

                   A         B        C         D
2013-01-01 -1.280554 -1.400685 -0.87505  0.050216

In [6]:
df.loc[dates[0:1]] # df[:dates[0]] yields the same df

                   A         B        C         D
2013-01-01 -1.280554 -1.400685 -0.87505  0.050216

In [7]:
df.iloc[0:2]

                   A         B         C         D
2013-01-01 -1.280554 -1.400685 -0.875050  0.050216
2013-01-02 -1.215928 -0.521857  0.517917 -0.205408

In [12]:
df.loc[dates[0:2]]

                   A         B         C         D
2013-01-01 -1.280554 -1.400685 -0.875050  0.050216
2013-01-02 -1.215928 -0.521857  0.517917 -0.205408

In [20]:
nfl

,Rank,Team,Won,Lost,Tied,Pct.,First NFL Season,Total Games,Division
0,1,Dallas Cowboys,493,367,6,0.573,1960,866,NFC East
1,2,Green Bay Packers,730,553,37,0.567,1921,"1,320",NFC North
2,3,Chicago Bears,744,568,42,0.565,1920,"1,354",NFC North
3,4,Miami Dolphins,439,341,4,0.563,1966,784,AFC East
4,5,New England Patriots,476,383,9,0.554,1960,868,AFC East

In [13]:
nfl.iloc[3] # information about the 3rd index row
# same as nfl.loc[3] as the index here is RangeIndex

Rank                             4
Team                Miami Dolphins
Won                            439
Lost                           341
Tied                             4
Pct.                         0.563
First NFL Season              1966
Total Games                    784
Division                  AFC East
Name: 3, dtype: object

In [14]:
nfl.loc[3:] # slicing the dataframe

,Rank,Team,Won,Lost,Tied,Pct.,First NFL Season,Total Games,Division
3,4,Miami Dolphins,439,341,4,0.563,1966,784,AFC East
4,5,New England Patriots,476,383,9,0.554,1960,868,AFC East

In [15]:
nfl.loc[:,['Won','Lost']] # selecting on a multi-axis by label

   Won  Lost
0  493   367
1  730   553
2  744   568
3  439   341
4  476   383

In [16]:
nfl.loc[1:3,['Won','Lost']] #label slicing with both endpoints

   Won  Lost
1  730   553
2  744   568
3  439   341

In [17]:
nfl.loc[3,['Won','Lost']] # reducing the dimensions of the returned  object

Won     439
Lost    341
Name: 3, dtype: object

In [18]:
nfl.loc[3,'Lost'] # simple way for getting a scalar value

341

In [19]:
nfl.at[3,'Team'] # for getting FAST access to a scalar value

'Miami Dolphins'